= Mecanismos de Recomendações
:neo4j-version: 2.0.0-RC1


*Sumário*

* *Introdução*
** <<introdução-ao-problema, Introdução ao Problema>>
* *Cenário*
** <<descrevendo-o-cenário, Descrevendo o Cenário>>
* *Solução*
** <<detalhamento-da-solução, Detalhamento da Solução>>
** <<como-bancos-de-dados-em-grafos-podem-ser-eficientes-nesse-cenário, Como Bancos de Dados em Grafos podem ser Eficientes nesse Cenário>>
* *Modelo de Dados*
** <<modelo-do-banco-de-dados-de-mecanismos-de-recomendação, Modelo do Banco de Dados de Mecanismos de Recomendação>>
* *Configuração do Banco de Dados*
** <<exemplo-do-banco-de-dados, Exemplo do Banco de Dados>>
* *Cypher Queries*
** <<criando-ofertas-para-o-e-mail-retargeting, Criando Ofertas para o E-mail Retargeting>>
** <<criando-as-queries-conforme-regras-de-negócio-pré-estabelecidas, Criando as Queries Conforme Regras de Negócio Pré-Estabelecidas>>
** <<criando-o-e-mail-retargeting, Criando o E-mail Retargeting>>

'''

== Introdução ao Problema

É de conhecimentos comum que um banco de dados é uma parte essencial de qualquer aplicação. Por isso a decisão de qual banco de dados utilizar para a sua aplicação é muito crucial. Você deve levar em consideração diversos fatores, muitas vezes as empresas optam por bancos de dados relacionais, os quais não são uma escolha ruim, porém dependendo da quantidade de dados a serem armazenados e se a aplicação depende de uma performance alta, talvez a melhora escolha seja um banco de dados NoSQL.

Existem diversos tipos de bancos de dados NoSQL, porém quando precisamos tratar especificamente de conexão entre dados que geralmente são problemas que empresas tentam resolver com um banco de dados relacional comum, podemos dizer com toda certeza que um banco de dados baseado em Grafos é a melhor maneira de suportar um cenário onde temos um grande volume de dados e de variedades de estruturas de dados sem contar a alta escalabilidade e velocidade. 

Tendo em mente toda essa capacidade do banco de dados, será tratado neste documento um caso de uso de uma agência de marketing que precisa melhorar o seu mecanismo de recomendação de produto para seus clientes ecommerces, melhorando o desempenho operacional e ajudando na diminuição de gastos com campanhas de marketing que não possuem um ROI positivo.


'''

== Descrevendo o Cenário

É difícil encontrar uma empresa online que não utilize algum tipo de mecanismo de recomendação para atingir seus clientes com produtos ou serviços relevantes. Um bom mecanismo de recomendação deve correlacionar muitos dados e ser capaz de detectar rapidamente novos interesses, rapidamente compreendê-los, buscar na web e recomendar de volta para os usuários.

Caso esse mecanismo não seja assertivo pode-se perder investimentos feitos na campanha de marketing por não ter um retorno, onde caso você esteja recomendando produtos para os usuários onde eles não possuem nenhum interesse, será apenas gerado um spam e essa campanha será ignorada. É exatamente o caso da agência de marketing XYZ, um dos produtos que a agência fornece à seus clientes é o E-mail Retargeting. Esse produto funciona com um mecanismo de recomendação que entende através de cookies a navegação do usuário nos websites dos ecommerces (clientes da agência) e dispara um e-mail pós navegação do usuário, com produtos que podem ser de interesse dele baseado no comportamento dele dentro do site.

A intenção é que esses produtos sejam produtos relacionados com as categorias pesquisadas e produtos visualizados, porém o mecanismo de e-mail retargeting da agência XYZ está falhando no sentido em que as relações dentro do atual banco de dados relacional não estão atualizando com a velocidade necessária e estão perdendo indexes. Como consequência dessa falha de arquitetura, os clientes estão sendo impactados por e-mails com produtos já comprados e estão entrando com vários chamados de reclamação de spam para os ecommerces.

Os ecommerces clientes da XYZ estão desistindo do produto devido a essa falha, alegando que o produto não está trazendo o mínimo de ROI esperado e que na realidade está gerando mais problemas para eles.


'''

== Detalhamento da Solução

Sendo focado em entidades e nas relações entre eles, um banco de dados em Grafo pode lidar facilmente com recomendações. Por ter esse foco, não importa a quantidade de nós dentro do data base, a capacidade de armazenamento e processamento será sempre a mesma, superando significativamente outros bancos de dados relacionais e não relacionais.

Para a agência XYZ esse modelo de banco de dados irá substancialmente resolver o cenário negativo com os clientes pois o problema de indexes incorretos deixará de existir uma vez que o banco de dados em Grafo não possui e essa estrutura e também esse banco tem uma alta escalabilidade da quantidade de dados armazenados como mencionado anteriormente e velocidade de atualização.


=== Como Bancos de Dados em Grafos podem ser Eficientes nesse Cenário

A ideia é construirmos uma campanha promocional eficiente que aumente as taxas de conversão dos usuários nos ecommerces. Para alcançar este objetivo o mecanismo de recomendação (e-mail retargeting) deve oferecer produtos alternativos aos usuários, por exemplo, se um usuário mostra interesse em um determinado produto, mas não o compra, devemos criar uma oferta que contenha produtos alternativos baseados nesses dados pré coletados.

Para criar esse mecanismo nós devemos: 

* Criar uma query que consulte produtos que não estão na Wish List do usuário, que não foram vistos (clicados) e nem comprados;
* Em paralelos, devemos ter uma query que consulte todas essas informações também. Quais produtos estão na Wish List, que foram vistos (clicados) e comprados;
* É de extrema importância também restringir as recomendações, por isso devemos nos certificar de que essas duas consultas selecionem produtos nas mesmas categorias;
* Por fim, por questões de relevância de preço, especificamos que apenas produtos que custam 20% a mais ou menos do que um item específico devem ser recomendados ao cliente.

Pronto, agora é possível criar a promoção com os produtos resultantes das pesquisas das queries acima. O banco de dados em Grafo é super eficiente e excelente quando se trata de  desempenho, independentemente do número e profundidade das queries.


'''

== Modelo do Banco de Dados de Mecanismos de Recomendação

Os bancos de dados em Grafo tem um design para lidar com grandes quantidades de conexões, fornecendo vantagens como performance, flexibilidade e agilidade que são argumentos chave quando tratamos de um mecanismo de recomendação em marketing.

No nosso caso de uso utilizaremos o Neo4j. Um banco de dados que pode lidar facilmente com recomendações, superando significativamente outros bancos de dados relacionais e não relacionais.
 
No grafo da imagem abaixo temos os nós e relações que representam onde cada produto está categorizado e qual a relação destes com os usuários:

image::https://github.com/KarlaLutz/pictures/blob/main/grafo.png[Grafo]

'''

== Exemplo do Banco de Dados

Abaixo é possível encontrar as queries utilizadas para a geração do banco de dados.
Todas foram criadas e executadas juntas, criando o banco de dados da imagem acima.


//setup
[source,cypher]
----

// Criando Categorias

CREATE (smartphones:Category {title: 'Smartphones'}), 
(notebooks:Category {title: 'Notebooks'}), 
(cameras:Category {title: 'Cameras'})

// Criando Produtos na categoria Smartphones
CREATE (lenovo_legion_phone_duel:Product {title: 'Lenovo Legion Phone Duel', price: 2400.00, shippability: true, availability: true})
CREATE (samsung_galaxy_s21_ultra:Product {title: 'Samsung Galaxy S21 Ultra', price: 3700.00, shippability: true, availability: true})
CREATE (moto_g100:Product {title: 'Moto G100', price: 2500.50, shippability: true, availability: false})
CREATE (iphone_12:Product {title: 'Apple iPhone 12', price: 4500.20, shippability: true, availability: false})
CREATE (xiaomi_mi_11:Product {title: 'Xiaomi Mi 11', price: 2826.87, shippability: true, availability: true})
CREATE (huawei_p50:Product {title: 'Huawei P50 Lite', price: 2000.00, shippability: true, availability: true})

// Realizando as conexões dos produtos com as categorias
MERGE (lenovo_legion_phone_duel)-[:IS_IN]->(smartphones)
MERGE (samsung_galaxy_s21_ultra)-[:IS_IN]->(smartphones)
MERGE (moto_g100)-[:IS_IN]->(smartphones)
MERGE (iphone_12)-[:IS_IN]->(smartphones)
MERGE (xiaomi_mi_11)-[:IS_IN]->(smartphones)
MERGE (huawei_p50)-[:IS_IN]->(smartphones)

// Criando Produtos na categoria Notebooks
CREATE (acer_aspire_5:Product {title: 'Acer Aspire 5', price: 3800.00, shippability: true, availability: false})
CREATE (hp_g8:Product {title: 'Notebook HP G8', price: 3600.30, shippability: true, availability: true})
CREATE (dell_inspiron_15:Product {title: 'Dell Inspiron 15', price: 3250.50, shippability: true, availability: true})
CREATE (apple_macbook_air_13:Product {title: 'Apple MacBook Air 13', price: 7500.00, shippability: false, availability: true})

// Realizando as conexões dos produtos com as categorias
MERGE (acer_aspire_5)-[:IS_IN]->(notebooks)
MERGE (hp_g8)-[:IS_IN]->(notebooks)
MERGE (dell_inspiron_15)-[:IS_IN]->(notebooks)
MERGE (apple_macbook_air_13)-[:IS_IN]->(notebooks)

// Criando Produtos na categoria Cameras
CREATE (canon_eos_rp:Product {title: 'Câmera Fotográfica EOS RP Body Canon', price: 7500.00, shippability: true, availability: false})
CREATE (nikon_ricoh:Product {title: 'Nikon Câmera Digital GR III Ricoh', price: 6600.35, shippability: true, availability: true})

// Realizando as conexões dos produtos com as categorias
MERGE (canon_eos_rp)-[:IS_IN]->(cameras)
MERGE (nikon_ricoh)-[:IS_IN]->(cameras)

----

//graph


//setup
[source,cypher]
----

// Criando Usuários

CREATE (karla:Customer {name: 'Karla Lutz', email: 'karla_lutz@exemplo.com', age: 26})
CREATE (ze:Customer {name: 'Zé Roberto Cavazzana', email: 'ze_cavazzana@exemplo', age: 32})
CREATE (nailinao:Customer {name: 'Nailinao Cortez', email: 'nailinao_cortez@exemplo.com', age: 26})
CREATE (mariana:Customer {name: 'Mariana Bege', email: 'menina_bege@examplo.com', age: 26})


// Realizando as conexões dos produtos com os usuarios baseado no comportamento dos mesmos

MERGE (karla)-[:VIEWED {views_count: 21}]->(nikon_ricoh)
MERGE (karla)-[:ADDED_TO_WISH_LIST]->(iphone_12)
MERGE (karla)-[:BOUGHT]->(apple_macbook_air_13)

MERGE(ze)-[:VIEWED {views_count: 50}]->(xiaomi_mi_11)
MERGE(ze)-[:VIEWED {views_count: 35}]->(dell_inspiron_15)
MERGE(ze)-[:ADDED_TO_WISH_LIST]->(dell_inspiron_15)

MERGE(nailinao)-[:VIEWED {views_count: 20}]->(canon_eos_rp)
MERGE(nailinao)-[:ADDED_TO_WISH_LIST]->(samsung_galaxy_s21_ultra)
MERGE(nailinao)-[:ADDED_TO_WISH_LIST]->(nikon_ricoh)
MERGE(nailinao)-[:BOUGHT]->(xiaomi_mi_11)

MERGE(mariana)-[:ADDED_TO_WISH_LIST]->(acer_aspire_5)
MERGE(mariana)-[:ADDED_TO_WISH_LIST]->(hp_g8)
MERGE(mariana)-[:BOUGHT]->(huawei_p50)
MERGE(mariana)-[:BOUGHT]->(lenovo_legion_phone_duel)


// Visualizar o grafo
match (n) return (n)


----

//graph

'''

== Criando Ofertas para o E-mail Retargeting

Para aumentar as taxas de conversão, devemos oferecer produtos alternativos aos usuários. Por exemplo, se um usuário mostra interesse em um determinado produto, mas não o compra, podemos criar uma oferta promocional que contenha opções de produtos alternativos.


=== Criando as Queries Conforme Regras de Negócio Pré-Estabelecidas

Primeiro, vamos criar uma oferta promocional para um usuário específico pensando nas regras que criamos anteriormente de produtos e preços:


[source,cypher]
----
MATCH (ze:Customer {name: 'Zé Roberto Cavazzana'})
MATCH (free_product:Product)
WHERE NOT ((ze)-->(free_product))
MATCH (product:Product)
WHERE ((ze)-->(product))

MATCH (free_product)-[:IS_IN]->()<-[:IS_IN]-(product)
WHERE ((product.price - product.price * 0.20) >= free_product.price <= (product.price + product.price * 0.20))

RETURN free_product;
----

//output
//table

=== Criando o E-mail Retargeting

Agora podemos criar nossa oferta que constará no e-mail. Neste ponto, vamos armazenar o e-mail do usuário como uma propriedade do relacionamento USED_TO_PROMOTE pois os produtos contidos na variável free_product não estão conectados a usuários específicos.


[source,cypher]
----
MATCH (ze:Customer {name: 'Zé Roberto Cavazzana'})
MATCH (free_product:Product)
WHERE NOT ((ze)-->(free_product))
MATCH (product:Product)
WHERE ((ze)-->(product))

MATCH (free_product)-[:IS_IN]->()<-[:IS_IN]-(product)
WHERE ((product.price - product.price * 0.20) >= free_product.price <= (product.price + product.price * 0.20))

CREATE(offer:PromotionalOffer {type: 'personal_replacement_offer', content: 'Oferta de Recomendação Personalizada para ' + ze.name})
WITH offer, free_product, ze
MERGE(offer)-[rel:USED_TO_PROMOTE {email: ze.email}]->(free_product)
RETURN offer, free_product, rel;
----

//output
//table
